---
kind: other
id: Properties.T:Autodesk.Revit.DB.RoutingPreferenceRule
source: html/106db4be-d5fe-17c1-05a7-edce3bd004df.htm
---
# RoutingPreferenceRule Properties

The description of the routing preference rule.